micropython/micropython/teensy/core/kinetis.h
#define KINETISK
#define HAS_KINETISK_UART0
#define HAS_KINETISK_UART0_FIFO
#define HAS_KINETISK_UART1
#define HAS_KINETISK_UART1_FIFO
#define HAS_KINETISK_UART2
#define HAS_KINETISK_UART3
#define HAS_KINETISK_UART4
#define HAS_KINETISK_UART5
#define HAS_KINETIS_I2C0
#define HAS_KINETIS_I2C0_STOPF
#define HAS_KINETIS_I2C1
#define HAS_KINETIS_I2C1_STOPF
#define HAS_KINETIS_I2C2
#define HAS_KINETIS_I2C2_STOPF
#define HAS_KINETIS_LLWU_32CH
#define HAS_KINETIS_MPU
#define HAS_KINETIS_ADC0
#define HAS_KINETIS_ADC1
#define HAS_KINETIS_FLASH_FTFE


#elif defined(__MK66FX1M0__)
// https://forum.pjrc.com/threads/24633-Any-Chance-of-a-Teensy-3-1?p=78655&viewfull=1#post78655
enum IRQ_NUMBER_t {
	IRQ_DMA_CH0 =		0,
	IRQ_DMA_CH1 =		1,
	IRQ_DMA_CH2 =		2,
	IRQ_DMA_CH3 =		3,
	IRQ_DMA_CH4 =		4,
	IRQ_DMA_CH5 =		5,
	IRQ_DMA_CH6 =		6,
	IRQ_DMA_CH7 =		7,
	IRQ_DMA_CH8 =		8,
	IRQ_DMA_CH9 =		9,
	IRQ_DMA_CH10 =		10,
	IRQ_DMA_CH11 =		11,
	IRQ_DMA_CH12 =		12,
	IRQ_DMA_CH13 =		13,
	IRQ_DMA_CH14 =		14,
	IRQ_DMA_CH15 =		15,
	IRQ_DMA_ERROR =		16,
	IRQ_MCM =		17,
	IRQ_FTFL_COMPLETE =	18,
	IRQ_FTFL_COLLISION =	19,
	IRQ_LOW_VOLTAGE =	20,
	IRQ_LLWU =		21,
	IRQ_WDOG =		22,
	IRQ_RNG =		23,
	IRQ_I2C0 =		24,
	IRQ_I2C1 =		25,
	IRQ_SPI0 =		26,
	IRQ_SPI1 =		27,
	IRQ_I2S0_TX =		28,
	IRQ_I2S0_RX =		29,
	IRQ_UART0_STATUS =	31,
	IRQ_UART0_ERROR =	32,
	IRQ_UART1_STATUS =	33,
	IRQ_UART1_ERROR =	34,
	IRQ_UART2_STATUS =	35,
	IRQ_UART2_ERROR =	36,
	IRQ_UART3_STATUS =	37,
	IRQ_UART3_ERROR =	38,
	IRQ_ADC0 =		39,
	IRQ_CMP0 =		40,
	IRQ_CMP1 =		41,
	IRQ_FTM0 =		42,
	IRQ_FTM1 =		43,
	IRQ_FTM2 =		44,
	IRQ_CMT =		45,
	IRQ_RTC_ALARM =		46,
	IRQ_RTC_SECOND =	47,
	IRQ_PIT_CH0 =		48,
	IRQ_PIT_CH1 =		49,
	IRQ_PIT_CH2 =		50,
	IRQ_PIT_CH3 =		51,
	IRQ_PDB =		52,
	IRQ_USBOTG =		53,
	IRQ_USBDCD =		54,
	IRQ_DAC0 =		56,
	IRQ_MCG =		57,
	IRQ_LPTMR =		58,
	IRQ_PORTA =		59,
	IRQ_PORTB =		60,
	IRQ_PORTC =		61,
	IRQ_PORTD =		62,
	IRQ_PORTE =		63,
	IRQ_SOFTWARE =		64,
	IRQ_SPI2 =		65,
	IRQ_UART4_STATUS =	66,
	IRQ_UART4_ERROR =	67,
	IRQ_CMP2 =		70,
	IRQ_FTM3 =		71,
	IRQ_DAC1 =		72,
	IRQ_ADC1 =		73,
	IRQ_I2C2 =		74,
	IRQ_CAN0_MESSAGE =	75,
	IRQ_CAN0_BUS_OFF =	76,
	IRQ_CAN0_ERROR =	77,
	IRQ_CAN0_TX_WARN =	78,
	IRQ_CAN0_RX_WARN =	79,
	IRQ_CAN0_WAKEUP =	80,
	IRQ_SDHC =		81,
	IRQ_ENET_TIMER =	82,
	IRQ_ENET_TX =		83,
	IRQ_ENET_RX =		84,
	IRQ_ENET_ERROR =	85,
	IRQ_LPUART0 =		86,
	IRQ_TSI =		87,
	IRQ_TPM1 =		88,
	IRQ_TPM2 =		89,
	IRQ_USBHS_PHY =		90,
	IRQ_I2C3 =		91,
	IRQ_CMP3 =		92,
	IRQ_USBHS =		93,
	IRQ_CAN1_MESSAGE =	94,
	IRQ_CAN1_BUS_OFF =	95,
	IRQ_CAN1_ERROR =	96,
	IRQ_CAN1_TX_WARN =	97,
	IRQ_CAN1_RX_WARN =	98,
	IRQ_CAN1_WAKEUP =	99
};
#define NVIC_NUM_INTERRUPTS	100
#define DMA_NUM_CHANNELS	32

#define DMAMUX_SOURCE_TSI		1
#define DMAMUX_SOURCE_UART0_RX		2
#define DMAMUX_SOURCE_UART0_TX		3
#define DMAMUX_SOURCE_UART1_RX		4
#define DMAMUX_SOURCE_UART1_TX		5
#define DMAMUX_SOURCE_UART2_RX		6
#define DMAMUX_SOURCE_UART2_TX		7
#define DMAMUX_SOURCE_UART3_RX		8
#define DMAMUX_SOURCE_UART3_TX		9
#define DMAMUX_SOURCE_UART4_RXTX	10
#define DMAMUX_SOURCE_I2S0_RX		12
#define DMAMUX_SOURCE_I2S0_TX		13
#define DMAMUX_SOURCE_SPI0_RX		14
#define DMAMUX_SOURCE_SPI0_TX		15
#define DMAMUX_SOURCE_SPI1_RX		16
#define DMAMUX_SOURCE_SPI1_TX		17
#define DMAMUX_SOURCE_I2C0		18
#define DMAMUX_SOURCE_I2C3		18
#define DMAMUX_SOURCE_I2C1		19
#define DMAMUX_SOURCE_I2C2		19
#define DMAMUX_SOURCE_FTM0_CH0		20
#define DMAMUX_SOURCE_FTM0_CH1		21
#define DMAMUX_SOURCE_FTM0_CH2		22
#define DMAMUX_SOURCE_FTM0_CH3		23
#define DMAMUX_SOURCE_FTM0_CH4		24
#define DMAMUX_SOURCE_FTM0_CH5		25
#define DMAMUX_SOURCE_FTM0_CH6		26
#define DMAMUX_SOURCE_FTM0_CH7		27
#define DMAMUX_SOURCE_FTM1_CH0		28
#define DMAMUX_SOURCE_TPM1_CH0		28
#define DMAMUX_SOURCE_FTM1_CH1		29
#define DMAMUX_SOURCE_TPM1_CH1		29
#define DMAMUX_SOURCE_FTM2_CH0		30
#define DMAMUX_SOURCE_TPM2_CH0		30
#define DMAMUX_SOURCE_FTM2_CH1		31
#define DMAMUX_SOURCE_TPM2_CH1		31
#define DMAMUX_SOURCE_FTM3_CH0		32
#define DMAMUX_SOURCE_FTM3_CH1		33
#define DMAMUX_SOURCE_FTM3_CH2		34
#define DMAMUX_SOURCE_FTM3_CH3		35
#define DMAMUX_SOURCE_FTM3_CH4		36
#define DMAMUX_SOURCE_FTM3_CH5		37
#define DMAMUX_SOURCE_FTM3_CH6		38
#define DMAMUX_SOURCE_SPI2_RX		38
#define DMAMUX_SOURCE_FTM3_CH7		39
#define DMAMUX_SOURCE_SPI2_TX		39
#define DMAMUX_SOURCE_ADC0		40
#define DMAMUX_SOURCE_ADC1		41
#define DMAMUX_SOURCE_CMP0		42
#define DMAMUX_SOURCE_CMP1		43
#define DMAMUX_SOURCE_CMP2		44
#define DMAMUX_SOURCE_CMP3		44
#define DMAMUX_SOURCE_DAC0		45
#define DMAMUX_SOURCE_DAC1		46
#define DMAMUX_SOURCE_CMT		47
#define DMAMUX_SOURCE_PDB		48
#define DMAMUX_SOURCE_PORTA		49
#define DMAMUX_SOURCE_PORTB		50
#define DMAMUX_SOURCE_PORTC		51
#define DMAMUX_SOURCE_PORTD		52
#define DMAMUX_SOURCE_PORTE		53
#define DMAMUX_SOURCE_IEEE1588_T0	54
#define DMAMUX_SOURCE_IEEE1588_T1	55
#define DMAMUX_SOURCE_FTM1_OV		55
#define DMAMUX_SOURCE_IEEE1588_T2	56
#define DMAMUX_SOURCE_FTM2_OV		56
#define DMAMUX_SOURCE_IEEE1588_T3	57
#define DMAMUX_SOURCE_LPUART0_RX	58
#define DMAMUX_SOURCE_LPUART0_TX	59
#define DMAMUX_SOURCE_ALWAYS0		60
#define DMAMUX_SOURCE_ALWAYS1		61
#define DMAMUX_SOURCE_ALWAYS2		62
#define DMAMUX_SOURCE_ALWAYS3		63
#define DMAMUX_NUM_SOURCE_ALWAYS	4

#define KINETISK
#define HAS_KINETISK_UART0
#define HAS_KINETISK_UART0_FIFO
#define HAS_KINETISK_UART1
#define HAS_KINETISK_UART1_FIFO
#define HAS_KINETISK_UART2
#define HAS_KINETISK_UART3
#define HAS_KINETISK_UART4
#define HAS_KINETISK_LPUART0
#define HAS_KINETIS_I2C0
#define HAS_KINETIS_I2C0_STOPF
#define HAS_KINETIS_I2C1
#define HAS_KINETIS_I2C1_STOPF
#define HAS_KINETIS_I2C2
#define HAS_KINETIS_I2C2_STOPF
#define HAS_KINETIS_I2C3
#define HAS_KINETIS_I2C3_STOPF
#define HAS_KINETIS_LLWU_32CH
#define HAS_KINETIS_MPU
#define HAS_KINETIS_ADC0
#define HAS_KINETIS_ADC1
#define HAS_KINETIS_TSI_LITE
#define HAS_KINETIS_FLASH_FTFE



#endif // end of board-specific definitions


#if (F_CPU == 240000000)
 #define F_PLL 240000000
 #ifndef F_BUS
 #define F_BUS 60000000
 //#define F_BUS 80000000   // uncomment these to try peripheral overclocking
 //#define F_BUS 120000000  // all the usual overclocking caveats apply...
 #endif
 #define F_MEM 30000000
#elif (F_CPU == 216000000)
 #define F_PLL 216000000
 #ifndef F_BUS
 #define F_BUS 54000000
 //#define F_BUS 72000000
 //#define F_BUS 108000000
 #endif
 #define F_MEM 27000000
#elif (F_CPU == 192000000)
 #define F_PLL 192000000
 #ifndef F_BUS
 #define F_BUS 48000000
 //#define F_BUS 64000000
 //#define F_BUS 96000000
 #endif
 #define F_MEM 27428571
#elif (F_CPU == 180000000)
 #define F_PLL 180000000
 #ifndef F_BUS
 #define F_BUS 60000000
 //#define F_BUS 90000000
 #endif
 #define F_MEM 25714286
#elif (F_CPU == 168000000)
 #define F_PLL 168000000
 #define F_BUS 56000000
 #define F_MEM 28000000
#elif (F_CPU == 144000000)
 #define F_PLL 144000000
 #ifndef F_BUS
 #define F_BUS 48000000
 //#define F_BUS 72000000
 #endif
 #define F_MEM 28800000
#elif (F_CPU == 120000000)
 #define F_PLL 120000000
 #ifndef F_BUS
 #define F_BUS 60000000
 //#define F_BUS 120000000
 #endif
 #define F_MEM 24000000
#elif (F_CPU == 96000000)
 #define F_PLL 96000000
 #ifndef F_BUS
 #define F_BUS 48000000
 //#define F_BUS 96000000
 #endif
 #define F_MEM 24000000
#elif (F_CPU == 72000000)
 #define F_PLL 72000000
 #ifndef F_BUS
 #define F_BUS 36000000
 //#define F_BUS 72000000
 #endif
 #define F_MEM 24000000
#elif (F_CPU == 48000000)
 #define F_PLL 96000000
 #if defined(KINETISK)
 #define F_BUS 48000000
 #elif defined(KINETISL)
 #define F_BUS 24000000
 #endif
 #define F_MEM 24000000
#elif (F_CPU == 24000000)
 #define F_PLL 96000000
 #define F_BUS 24000000
 #define F_MEM 24000000
#elif (F_CPU == 16000000)
 #define F_PLL 16000000
 #define F_BUS 16000000
 #define F_MEM 16000000
#elif (F_CPU == 8000000)
 #define F_PLL 8000000
 #define F_BUS 8000000
 #define F_MEM 8000000
#elif (F_CPU == 4000000)
 #define F_PLL 4000000
 #define F_BUS 4000000
 #define F_MEM 4000000
#elif (F_CPU == 2000000)
 #define F_PLL 2000000
 #define F_BUS 2000000
 #define F_MEM 1000000
#endif


